// первое слово каждого набора - Нормальная форма слова (лемма)

dict = [
    ["мороженое", "мороженого", "мороженом", "морожку", "морожка"],
    ["шоколад", "шоколада", "шоколаду", "шоколадный", "шоколадные", "шоколадными", "шоколадных", "шоколадного", "шоколадная", "шоколадную", "шоколадной", "шоколадное", "шоколадному"],
    ["яблоко", "яблок", "яблоком", "яблока", "яблочный", "яблочная", "яблочное", "яблочного", "яблочной", "яблоных", "яблочным", "яблоком"],
    ["вишня", "вишни", "вишней", "вишневый", "вишневая", "вишневых", "вишневым", "вишневыми", "вишневые"],
    ["лимон", "лимона", "лимонов", "лимоновый", "лимоновая", "лимонный", "лимонная", "лимоновый", "лимонный", "лимоном", "лимоновое", "лимонное"],
    ["апельсин", "апельсина", "апельсином", "апельсиновый", "апельсиновым", "апельсиновыми", "апельсиновые", "апельсиновое", "апельсиновая"],
    ["шоколад", "шоколадный", "шоколада", "шоколадом", "шоколадными", "шоколадная", "шоколадное", "шоколадные", "шоколадном"],
    ["сша", "соединенные штаты америки", "америка", "америки", "американский", "американское", "американская", "американского", "американских", "американскими"],
    ["италия", "италии", "италией", "итальянский", "итальянская", "итальянское", "итальянскими", "итальянского"],
    ["россия", "российского", "россии", "российский", "российских", "российское", "российском", "русского", "русских", "русское", "русская", "русском", "русский", "отечественный", "отечественного", "отечественных", "отечественное", "отечественном"],
    ["babkin bobbins", "бабкин бобинс", "бабкин боббинс"],
    ["dolcevita", "dolce vita", "дольче вита", "дольчевита"],
    ["отморозки", "от морозки"],
]

dict.yes = ["да", "давай"]
dict.no = ["нет", "неа"]

dict.hello = ["привет", "здарова", "здравствуй"]
dict.about = ["кто", "о себе", "ты"]
dict.help = ["умеешь", "помощь", "подсказка"]
dict.price = ["цена", "стоимость", "стоит", "цены", "цену", "почем", "купить"]
dict.bestPrice = ["дешевый", "дешевое", "дешевая", "дешевые", "дешево", "не дорогие", "дешевле"]
dict.sale = ["скидка", "скидки", "скидочный", "акция", "акции", "акционный", "распродажа", "распродажи"]
dict.rating = ["лучший", "лучшая", "лучшее", "лучшие", "вкусный", "вкусная", "вкусное", "вкусные", "оценка"]
dict.nutrition = ["калорий", "калориность", "белка", "белков", "белок", "углеводов", "углеводы", "жиры", "жиров", "жира"]

dict.gde = ["где", "находится", "ближайший"]
dict.magaz =  ["магазин", "магазине"]

dict.others = ["медведь", "охотника", "увидел", "поймал"]

// второй словарь для работы
dictSys = []

for(i = 0, dictSys.goodsProperties = []; i < dict.length; i++){
    dictSys.goodsProperties[i] = dict[i][0]
}

for(i = 0, dictSys.goodsPropertiesAll = []; i < dict.length; i++){
    dictSys.goodsPropertiesAll[i] = dict[i]
}